In [7]:
import numpy as np
import pandas as pd

fb = pd.read_csv('Dataset/fb_2018.csv', index_col='date', parse_dates=True).assign(
    trading_volume=lambda x: pd.cut(x.volume, bins=3, labels=['low', 'med', 'high'])
)
fb.tail()

              open    high     low   close    volume trading_volume
date
2018-12-24  123.10  129.74  123.02  124.06  22066002            low
2018-12-26  126.00  134.24  125.89  134.18  39723370            low
2018-12-27  132.44  134.99  129.67  134.52  31202509            low
2018-12-28  135.34  135.92  132.20  133.20  22627569            low
2018-12-31  134.45  134.64  129.95  131.09  24625308            low

In [9]:
weather = pd.read_csv('Dataset/weather_by_station.csv', index_col='date', parse_dates=True)
weather.head()

           datatype            station  value                    station_name
date
2018-01-01     PRCP  GHCND:US1CTFR0039    0.0           STAMFORD 4.2 S, CT US
2018-01-01     PRCP  GHCND:US1NJBG0015    0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0015    0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2018-01-01     PRCP  GHCND:US1NJBG0017    0.0        GLEN ROCK 0.7 SSE, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0017    0.0        GLEN ROCK 0.7 SSE, NJ US

In [12]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [13]:
fb.agg({
    'open': np.mean, 
    'high': np.max, 
    'low': np.min, 
    'close': np.mean, 
    'volume': np.sum
})

open            171.454
high            218.620
low             123.020
close           171.511
volume   6949682394.000
dtype: float64

In [14]:
weather.query('station == "GHCND:USW00094728"')\
    .pivot(columns='datatype', values='value')[['SNOW', 'PRCP']]\
    .sum()

datatype
SNOW   1007.000
PRCP   1665.300
dtype: float64

In [15]:
weather.query('station == "GHCND:USW00094728"')\
    .pivot(columns='datatype', values='value')[['SNOW', 'PRCP']]\
    .agg('sum')

datatype
SNOW   1007.000
PRCP   1665.300
dtype: float64

In [16]:
fb.agg({
    'open': 'mean',
    'high': ['min', 'max'],
    'low': ['min', 'max'],
    'close': 'mean'
})

        open    high     low   close
mean 171.454     NaN     NaN 171.511
min      NaN 129.740 123.020     NaN
max      NaN 218.620 214.270     NaN